---
title: Hardwood
classe: Autodesk.Revit.DB.Visual.Hardwood
namespace: Autodesk.Revit.DB.Visual
eredita: System.Object
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 10
---

# Hardwood

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `String CommonTintColor { get; }` | `Hardwood.CommonTintColor` | String |
| `String CommonTintToggle { get; }` | `Hardwood.CommonTintToggle` | String |
| `String HardwoodApplication { get; }` | `Hardwood.HardwoodApplication` | String |
| `String HardwoodColor { get; }` | `Hardwood.HardwoodColor` | String |
| `String HardwoodFinish { get; }` | `Hardwood.HardwoodFinish` | String |
| `String HardwoodImperfections { get; }` | `Hardwood.HardwoodImperfections` | String |
| `String HardwoodImperfectionsAmount { get; }` | `Hardwood.HardwoodImperfectionsAmount` | String |
| `String HardwoodImperfectionsShader { get; }` | `Hardwood.HardwoodImperfectionsShader` | String |
| `String HardwoodTintColor { get; }` | `Hardwood.HardwoodTintColor` | String |
| `String HardwoodTintEnabled { get; }` | `Hardwood.HardwoodTintEnabled` | String |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```